//using System;
//using System.Reflection;
//using System.Text;
//using System.Threading;

//namespace ConsoleApp
//{
//    class Program_1
//    {
//        static void Main(string[] args)
//        {
//            //Задание 1 Пользователь вводит с клавиатуры три числа. Необходимо найти сумму чисел, произведение чисел. Результат 
//            //вычислений вывести на экран.
//            //Console.WriteLine("Enter the first number");
//            //string? Enter0 = Console.ReadLine();
//            //int number0;
//            //if (int.TryParse(Enter0, out number0)) ; 

//            //Console.WriteLine("Enter the second number");
//            //string? Enter1 = Console.ReadLine();
//            //int number1;
//            //if (int.TryParse(Enter1, out number1)) ;

//            //Console.WriteLine("Enter the third number");
//            //string? Enter2 = Console.ReadLine();
//            //int number2;
//            //if (int.TryParse(Enter2, out number2)) ;
//            //Console.WriteLine($"Summ numbers = { number0 + number1 + number2}");
//            //Console.WriteLine($"Product of numbers = { number0 - number1 - number2}");


//            //Задание 2 Пользователь вводит с клавиатуры три числа. Первое число — зарплата за месяц, второе число — сумма месячного платежа
//            //по кредиту в банке, третье число — задолженность за коммунальные услуги.Необходимо вывести на экран сумму,
//            //которая останется у пользователя после всех выплат.
//            //Console.WriteLine("Enter the salary");
//            //string? EnterSalary = Console.ReadLine();
//            //int salary;
//            //if (int.TryParse(EnterSalary, out salary)) ;

//            //Console.WriteLine("Enter the monthly payment for a bank loan");
//            //string? EnterMonPayAmount = Console.ReadLine();
//            //int monPayAmount;
//            //if (int.TryParse(EnterMonPayAmount, out monPayAmount)) ;

//            //Console.WriteLine("Enter the utility bills");
//            //string? EnterUtilityBills = Console.ReadLine();
//            //int utilityBills;
//            //if (int.TryParse(EnterUtilityBills, out utilityBills)) ;
//            //Console.WriteLine($"After all payments, the user will have = { salary - monPayAmount - utilityBills}");


//            //Задание 3 Напишите программу, вычисляющую площадь ромба.Пользователь с клавиатуры вводит длину двух его диагоналей.
//            //Console.WriteLine("Enter the first diagonal");
//            //string? EnterDiagonal0 = Console.ReadLine();
//            //int diagonal0;
//            //if (int.TryParse(EnterDiagonal0, out diagonal0)) ;

//            //Console.WriteLine("Enter the second diagonal");
//            //string? EnterDiagonal1 = Console.ReadLine();
//            //int diagonal1;
//            //if (int.TryParse(EnterDiagonal1, out diagonal1)) ;
//            //Console.WriteLine($"Area of a rhombus = {(diagonal0 * diagonal1) / 2}");


//            //Задание 4 Выведите на экран надпись To be or not to be на разных строках.
//            //Console.WriteLine("To be\n" + "or not\n" + "to be\n");
//            //Console.WriteLine("To be\nor not\nto be\n");


//            //Задание 5 Выведите на экран надпись «Life is what happens when you're busy making other plans» John Lennon на разных строках.
//            //Console.WriteLine("«Life is what happens\n\twhen\n\tyou're busy making other plans»\n\t\t\t\t\tJohn Lennon");
//        }
//    }
//}
