import React from 'react';

function Cooking() {
    return (
        <p >Чтобы приготовить корн-доги, подготовить продукты. Для рецепта берите свои любимые вкусные сосиски. Если дома не нашли кукурузную муку, ее можно заменить пшеничной и сделать кляр только из пшеничной муки, будет тоже очень вкусно.
            Смешиваем сухие ингредиенты в емкости с высокими стенками, чтобы в дальнейшем было легко окунать сосиски.
            Добавляем яйцо, перемешиваем, вливаем молоко до получения очень густого теста.
            Сосиски предварительно обваливаем в муке.
            Прокалываем каждую сосиску шпажкой и окунаем в тесто полностью, чтобы верхняя часть шпажки тоже покрылась тестом.
            Разогреваем фритюр до 150-170 градусов, обжариваем сосиски в тесте, вращая шпажки, чтобы корн-доги равномерно зарумянились.
            Подаем с любимыми соусами и наслаждаемся!
            <br></br>
        </p>
    );
}

export default Cooking;